src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_ИсходныеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/инт_СтатусыИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФормирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////

// <ОчередьИсходящихСообщений>

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Зарегистрировать сообщение
//
// Параметры:
//  ИсходныеДанные      -  ОпределяемыйТип.инт_ИсходныеДанные  - Ссылка на объект, или же фиксированная структура содержащая исходные данные для формирования сообщения
//  ПотокДанных         -  СправочникСсылка.инт_ПотокиДанных   - Ссылка на поток данных.
//
Процедура ЗарегистрироватьСообщение(ИсходныеДанные, ПотокДанных) Экспорт
    
    Если Не ПотокДанных.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
        ВызватьИсключение "Нельзя регистрировать в очереди исходящих сообщений входящие потоки!";
    КонецЕсли;
    НачатьТранзакцию();
    Попытка
        Запись = РегистрыСведений.инт_ОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
        Запись.ИдентификаторСообщения = Новый УникальныйИдентификатор;
        Запись.ПотокДанных = ПотокДанных;
        Запись.ИсходныеДанные = ИсходныеДанные;
        Запись.Записать();
        
        РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(Запись.ИдентификаторСообщения, Перечисления.инт_СтатусыИсходящихСообщений.Новый);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение ОписаниеОшибки();
    КонецПопытки;

КонецПроцедуры

// Процедура - Сформировать сообщение по идентификатору
// Формирует сообщение по идентификатору и записывает его в регистр.
//
// Параметры:
//  ИдентификаторСообщения     -   УникальныйИдентификатор   - Идентификатор сообщения которое требуется сформировать.
//
Процедура СформироватьСообщениеПоИдентификатору(ИдентификаторСообщения) Экспорт
    СообщениеВОчереди = ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения);
    СформированноеСообщение = Справочники.инт_ПотокиДанных.СформироватьСообщениеПоПотоку(СообщениеВОчереди.ИсходныеДанные, СообщениеВОчереди.ПотокДанных);
    
    НачатьТранзакцию();
    Попытка
        ЗаписатьСформированноеСообщение(ИдентификаторСообщения, СформированноеСообщение);
        РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(ИдентификаторСообщения, Перечисления.инт_СтатусыИсходящихСообщений.ГотовоКОтправке);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(ИдентификаторСообщения, Перечисления.инт_СтатусыИсходящихСообщений.ОшибкаФормирования, ПодробноеПредставлениеОшибки);
        СообщениеОбОшибке = СтрШаблон("При попытке сформировать сообщение с идентификатором <%1> возникла ошибка.
        |
        |Информация об ошибке: %2", ИдентификаторСообщения, ПодробноеПредставлениеОшибки);
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
    КонецПопытки;
КонецПроцедуры

// Функция - Получить данные очереди по идентификатору
//
// Параметры:
//  ИдентификаторСообщения     -  УникальныйИдентификатор  -  Идентификатор сообщения по которому будут получены данные
// 
// Возвращаемое значение:
//  Структура - Структура данных сообщения. См. функцию ПолучитьШаблонСтруктурыСообщенияОчереди
//
Функция ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения) Экспорт
	СтруктураСообщения = ПолучитьШаблонСтруктурыСообщенияОчереди();
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    инт_ОчередьИсходящихСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
                   |    инт_ОчередьИсходящихСообщений.ИсходныеДанные КАК ИсходныеДанные,
                   |    инт_ОчередьИсходящихСообщений.СформированноеСообщение КАК СформированноеСообщение,
                   |    инт_ОчередьИсходящихСообщений.ПотокДанных КАК ПотокДанных
                   |ИЗ
                   |    РегистрСведений.инт_ОчередьИсходящихСообщений КАК инт_ОчередьИсходящихСообщений
                   |ГДЕ
                   |    инт_ОчередьИсходящихСообщений.ИдентификаторСообщения = &ИдентификаторСообщения";
    Запрос.УстановитьПараметр("ИдентификаторСообщения",ИдентификаторСообщения);
    Выборка = Запрос.Выполнить().Выбрать();
    Если выборка.Следующий() Тогда
        ЗаполнитьЗначенияСвойств(СтруктураСообщения, Выборка,,"СформированноеСообщение");
        СтруктураСообщения.СформированноеСообщение = Выборка.СформированноеСообщение.Получить();
    КонецЕсли;
    Возврат СтруктураСообщения;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСформированноеСообщение(ИдентификаторСообщения, СформированноеСообщение)
  	Запись = РегистрыСведений.инт_ОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
    Запись.ИдентификаторСообщения = ИдентификаторСообщения;
    Запись.Прочитать();
    Запись.СформированноеСообщение = Новый ХранилищеЗначения(СформированноеСообщение, Новый СжатиеДанных(9));
    Запись.Записать(Истина);
КонецПроцедуры
  
Функция ПолучитьШаблонСтруктурыСообщенияОчереди()
	Возврат Новый Структура("ИдентификаторСообщения, ИсходныеДанные, ПотокДанных, СформированноеСообщение",
                                            Новый УникальныйИдентификатор,
                                            Неопределено,
                                            Справочники.инт_ПотокиДанных.ПустаяСсылка(),
                                            Новый Соответствие);
КонецФункции

#КонецОбласти

#КонецЕсли
